GCSE/GCSE_Practical_Programming/pages/CA_Writeup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Controlled Assessment Write Up</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Controlled Assessment Write Up</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Controlled Assessment Write up</a>
<ul>
<li><a href="#sec-1-1">Part 1 - Design of solution</a></li>
<li><a href="#sec-1-2">Part 2 - Solution development</a></li>
<li><a href="#sec-1-3">Part 3 - Programming techniques used</a></li>
<li><a href="#sec-1-4">Part 4 - Testing and evaluation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="https://github.com/MarcScott/GCSE-CS">Fork me on GitHub</a>
</div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Controlled Assessment Write up</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Part 1 - Design of solution</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Show an understanding of what the problem involves with reference to the user's needs.
<ul class="org-ul">
<li>A brief write up of what the user requires.
</li>
<li>Ensure you talk about the user's requirements rather than what the program will do.
</li>
<li>Create a bulleted list of user requirements.
</li>
</ul>
</li>
<li>Produce and overview plan that shows how the problem is to be solved.
<ul class="org-ul">
<li>Use a flowchart-like diagram to show the basic inputs and outputs of the program.
</li>
<li>Provide a description of how you are going to tackle the problem (Here you can mention any data structures you might need, what functions you might need, and global variables you might need, as well as assets such as text files.)
</li>
</ul>
</li>
<li>Produce pseudo code (or suitable alternative) showing the main blocks within the proposed solution.
<ul class="org-ul">
<li>Produce a fully annotated pseudo code listing of the entire program.
</li>
<li>Be sure <span class="underline">not</span> to use Python specific syntax
</li>
<li>Use structured English if the <a href="http://filestore.aqa.org.uk/subjects/AQA-GCSE-COMPSCI-W-TRB-PSEU.PDF">AQA pseudo code</a> help sheet does not contain the syntax you need.
</li>
</ul>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Part 2 - Solution development</h3>
<div class="outline-text-3" id="text-1-2">

<ol class="org-ol">
<li>Show evidence of an understanding of how the final solution meets the needs of the user.
<ul class="org-ul">
<li>Refer back to your original list of user requirements.
</li>
<li>For each point, say how your program meets this need.
</li>
</ul>
</li>
<li>Produce annotated code that demonstrates an understanding of the programming techniques used.
<ul class="org-ul">
<li>Go through the original task sheet.
</li>
<li>For each task, display and explain the code that you used to complete the task
</li>
<li>Use screenshots of your program working to assist in your explanation.
</li>
<li>At the end, provide a full code listing with comments.
</li>
</ul>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Part 3 - Programming techniques used</h3>
<div class="outline-text-3" id="text-1-3">

<ol class="org-ol">
<li>Show an understanding of the programming techniques used and how the different parts of the solution work together.
<ul class="org-ul">
<li>Provide an explanation of each of the following programming techniques <span class="underline">you actually used</span>, with reference to where they have been used in your code.
<ul class="org-ul">
<li>Global Variables, Local Variables, Lists, Dictionaries, Conditional Selection, For loops, While loops, Functions, Error Handling (Try/Except), Read/Write.
</li>
</ul>
</li>
<li>Show how the program works together by using flowcharts to show the flow of data through the program.
</li>
</ul>
</li>
<li>Explain/Justify the choice of programming techniques used to create a solution that has been coded efficiently.
<ul class="org-ul">
<li>Show areas where the same function is called in different parts of the program.
</li>
<li>Show areas where lists were used to store data
</li>
<li>Show areas where data is passed between functions rather than using global variables.
</li>
</ul>
</li>
<li>Show evidence for the purpose and use of data structures.
<ul class="org-ul">
<li>Show areas where you have used lists, dictionaries, objects, files, strings
</li>
<li>Describe the purpose of each data structure.
</li>
</ul>
</li>
<li>Show the techniques used (appropriate to the language used) within the code to make the solution robust.
<ul class="org-ul">
<li>Demonstrate the techniques used to avoid errors occurring, such as a user entering nonsense or incorrect data.
</li>
</ul>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Part 4 - Testing and evaluation</h3>
<div class="outline-text-3" id="text-1-4">

<ol class="org-ol">
<li>Produce a test plan that show the expected tests, test data and expected results.
<ul class="org-ul">
<li>Create a table with the column headings above.
</li>
<li>Consider all possible data that the user could enter.
</li>
<li>Detail the expected result.
</li>
</ul>
</li>
<li>Show that the planned tests have been carried out and provide a record of the actions taken.
<ul class="org-ul">
<li>For each of the tests above, provide screen shot evidence of your program.
</li>
<li>Record if the program passed the test.
</li>
<li>Record action taken if the program failed the test.
</li>
</ul>
</li>
<li>Evaluate how the final solution meets the needs of the user.
<ul class="org-ul">
<li>For each of the needs of the user, listed in Part 1.
<ul class="org-ul">
<li>Evaluate how well the program meets this need and suggest possible improvements.
</li>
</ul>
</li>
</ul>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
